---
type: Arc
namespace: Autodesk.Revit.DB
version: 2024
members: 8
tags: [revit-api, class]
---

# Arc

`Autodesk.Revit.DB.Arc` · Revit 2024 · 8 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | — | `` |
| Method | Intersect | — | `` |
| Method | IsInside | — | `` |
| Property | Center | — | `public XYZ Center { get ; }` |
| Property | Normal | — | `public XYZ Normal { get ; }` |
| Property | Radius | — | `public double Radius { get ; }` |
| Property | XDirection | — | `public XYZ XDirection { get ; }` |
| Property | YDirection | — | `public XYZ YDirection { get ; }` |